Config = {}

Config['Weapon'] = {
    ["WEAPON_UNARMED"] = {
        Damage = 4 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = false,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 0 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_DAGGER"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_BAT"] = {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_BOTTLE"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_CROWBAR"] = {
        Damage = 10 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_FLASHLIGHT"] = {
        Damage = 10 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_GOLFCLUB"] = {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = true, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_HAMMER"] = {
        Damage = 10 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_HATCHET"] = {
        Damage = 5 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNUCKLE"] = {
        Damage = 11 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNIFE"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_MACHETE"] = {
        Damage = 34 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_SWITCHBLADE"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_POOLCUE"] = {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = true, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },

    ["WEAPON_BAT+1"] = 
    {
        Damage = 6 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_BAT+2"] = 
    {
        Damage = 9 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_BAT+3"] = 
    {
        Damage = 14 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_BAT+4"] = 
    {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_BAT+5"] = 
    {
        Damage = 22 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    -------------------ไม้กล์อฟ--------------------------------
    ["WEAPON_GOLFCLUB+1"] = 
    {
        Damage = 6 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_GOLFCLUB+2"] = 
    {
        Damage = 9 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_GOLFCLUB+3"] = 
    {
        Damage = 14 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_GOLFCLUB+4"] = 
    {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_GOLFCLUB+5"] = 
    {
        Damage = 22 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    -------------------ไม้พลู--------------------------------
    ["WEAPON_POOLCUE+1"] = 
    {
        Damage = 8 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_POOLCUE+2"] = 
    {
        Damage = 11 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_POOLCUE+3"] = 
    {
        Damage = 16 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_POOLCUE+4"] = 
    {
        Damage = 20 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_POOLCUE+5"] = 
    {
        Damage = 25 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    -------------------มีด--------------------------------
    ["WEAPON_KNIFE+1"] = 
    {
        Damage = 10 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNIFE+2"] = 
    {
        Damage = 14 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNIFE+3"] = 
    {
        Damage = 17 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNIFE+4"] = 
    {
        Damage = 20 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNIFE+5"] = 
    {
        Damage = 25 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    -------------------สนับ--------------------------------
    ["WEAPON_KNUCKLE+1"] = 
    {
        Damage = 5 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNUCKLE+2"] = 
    {
        Damage = 6 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNUCKLE+3"] = 
    {
        Damage = 7 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNUCKLE+4"] = 
    {
        Damage = 8 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_KNUCKLE+5"] = 
    {
        Damage = 9 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
    ["WEAPON_RUN_OVER_BY_CAR"] = {
        Damage = 0 , 
        ----------------------------------------------------
        Critical = false, -- เปิด ให้คริ true // ปิด false [[[[___ได้แต่ไม้___]]]]
        Critical_Chance = 100, -- โอกาสติดคริ เวลาตีหัว         
        Shake_Cam = true,       -- เปิด - ปิด การสั่นของหน้าจอผู้เล่นเมื่อถูกคริ และ โดนเจาะเกราะ
        Chance_Penetrate = 50 ,         --  หากต้องการเปิดให้ใส่เลขมากกว่า 0 ถ้ามากกว่า 0 คือมีโอกาสเข้าเลือด
        Damage_Penetrate = { 2 , 5}    --  ดาเมจสุ่มในระหว่าง ตัวแรก ถึง ตัวหลัง ถ้าหากอยากได้ดาเมจคงที่ ให้ ตั้งเลขเท่ากันทั้ง 2 ตัว
        ----------------------------------------------------
    },
}