-- หมวดหมู่

Config.Category = {

	-- อาหาร --

	["inventory_food"] = {
		 "water",    -- ใส่ชื่อไอเทม ( ห้ามซํ้ากับหมวดหมู่อื่น )
         "bread",
         "sanwich",
         "burger",
         "tomyum",
    },

	-- เสื้อผ้า หน้ากาก เเฟชั่นอื่นๆ --

    ["inventory_clothes"] = { -- ไม่จําจต้องใส่ก็ได้นะครับ มันดึงอัติโนมัติอยู่เเล้ว
        -- "mask_1",
        -- "mask_2",

        -- "ears_1",
        -- "ears_2",

        -- "glasses_1",
        -- "glasses_2",

        -- "helmet_1",
        -- "helmet_2",


        
		-- "Box_1",    -- ใส่ชื่อไอเทม ( ห้ามซํ้ากับหมวดหมู่อื่น )
        -- "cement", 
    },
    
	-- กุญเเจรถ --

	["inventory_keys"] = { -- ไม่จําจต้องใส่ก็ได้นะครับ มันดึงอัติโนมัติอยู่เเล้ว
        -- "Box_1",    -- ใส่ชื่อไอเทม ( ห้ามซํ้ากับหมวดหมู่อื่น )
        -- "cement", 
    },

	-- อาวุธ --

	["inventory_weapon"] = { -- ไม่จําจต้องใส่ก็ได้นะครับ มันดึงอัติโนมัติอยู่เเล้ว
        -- "Box_1",    -- ใส่ชื่อไอเทม ( ห้ามซํ้ากับหมวดหมู่อื่น )
        -- "cement", 
        "aed",
        "painkiller",
        "armor"
    },
}
