CONFIG = {}

CONFIG.MAXQUEUE = 5                     -- จำนวนคิวสูงสุดของประกาศ

CONFIG.ADMIN = {                        -- ตั้งค่าประกาศแอดมิน
    Command = 'anm',                    -- คำสั่งที่ใช้ในการประกาศ
    Permission = 'admin',               -- superadmin || admin
    Pic = 'server.png',                 -- ชื่อไฟล์รูปภาพของประกาศ
    Color = '#001bbe',                  -- ธีมสีของประกาศ
    Duration = 10                       -- ความล่าช้าในการลบข้อความ ประกาศ (วินาที)
}

CONFIG.DEPARTMENT = {                   -- ตั้งค่าประกาศหน่วยงาน (เพิ่ม/ลดได้ไม่จำกัด)
    {
        Command = 'pd',          -- คำสั่งที่ใช้ในการประกาศ
        Job = 'police',                 -- อาชีพที่สามารถใช่คำสั่งได้
        Job_Grade = 0,                  -- ลำดับตำแหน่งอาชีพ (ขั้นต่ำ) ที่สามารถใช้คำสั่งได้
        Pic = 'police.png',             -- ชื่อไฟล์รูปภาพของประกาศ
        Color = '#001bbe',              -- ธีมสีของประกาศ
        Duration = 10                   -- ความล่าช้าในการลบข้อความ ประกาศ (วินาที)
    },
    {
        Command = 'md',           -- คำสั่งที่ใช้ในการประกาศ
        Job = 'ambulance',              -- อาชีพที่สามารถใช่คำสั่งได้
        Job_Grade = 0,                  -- ลำดับตำแหน่งอาชีพ (ขั้นต่ำ) ที่สามารถใช้คำสั่งได้
        Pic = 'ambulance.png',          -- ชื่อไฟล์รูปภาพของประกาศ
        Color = '#001bbe',              -- ธีมสีของประกาศ
        Duration = 10                   -- ความล่าช้าในการลบข้อความ ประกาศ (วินาที)
    },
    {
        Command = 'cc',           -- คำสั่งที่ใช้ในการประกาศ
        Job = 'council',              -- อาชีพที่สามารถใช่คำสั่งได้
        Job_Grade = 0,                  -- ลำดับตำแหน่งอาชีพ (ขั้นต่ำ) ที่สามารถใช้คำสั่งได้
        Pic = 'council.png',          -- ชื่อไฟล์รูปภาพของประกาศ
        Color = '#001bbe',              -- ธีมสีของประกาศ
        Duration = 10                   -- ความล่าช้าในการลบข้อความ ประกาศ (วินาที)
    },
    {
        Command = 'mc',           -- คำสั่งที่ใช้ในการประกาศ
        Job = 'mechanic',              -- อาชีพที่สามารถใช่คำสั่งได้
        Job_Grade = 0,                  -- ลำดับตำแหน่งอาชีพ (ขั้นต่ำ) ที่สามารถใช้คำสั่งได้
        Pic = 'mechanic.png',          -- ชื่อไฟล์รูปภาพของประกาศ
        Color = '#001bbe',              -- ธีมสีของประกาศ
        Duration = 10                   -- ความล่าช้าในการลบข้อความ ประกาศ (วินาที)
    },
}

CONFIG.AUTOMATE = {
    Enable = true,                      -- เปิดใช้งาน ประกาศข้อความโดยอัตโนมัติหรือไม่? (true เท่ากับเปิดใช้งาน | false เท่ากับ ปิดใช้งาน)
    Pic = 'server.png',                   -- ชื่อไฟล์รูปภาพของประกาศ
    Color = '#001bbe',                  -- ธีมสีของประกาศ
    Duration = 10,                      -- ความล่าช้าในการลบข้อความ ประกาศ (วินาที)
    Delay = 15 ,                         -- ดีเลย์ในการประกาศข้อความโดยอัตโนมัติ (นาที)
    msgLists = {                        -- ข้อความที่ต้องการประกาศโดยอัตโนมัติ
        'ติดตามข่าวสารและกิจกรรมต่างๆ ได้ที่ Discord Server ของเรา',
        'หากพบผู้กระทำความผิด โปรดแจ้งติดต่อทีมงานใน Ticket Discord' ,
        'ตั้งชื่อ Steam และ Discord ของท่านให้ตรงกับชื่อ IC หากทีมงานพบเจอจะใส่บิล 50,000 IC' ,
        'ยินดีต้อนรับผู้เล่นทุกท่านสู่ประเทศ Lolipop Town ขอให้สนุกกับการสวมบทบาท' ,
        'ReStart Time 00.00 / 12.00 / 18.00 กรณีรีประเทศด่วนทีมงานจะประกาศให้ทราบ' ,
    }
}