cfg.List = {
    {
        Coords = vector3( -606.50, -127.05, 39.01 ), -- ตำแหน่ง
        Blips = { -- ไอคอนบนแมพ
            Id = 233, -- ประเภท
            Size = 0.9, -- ขนาด
            Color = 1, -- สี
            Name = "BU EXTRA", -- ชื่อ
            Radius = true, -- วงคลุมไอคอน
        },
        PressKey = { -- การกดปุ่ม
            Distance = 1.0, -- ระยะในการกดปุ่ม
            Key = "E", -- ชื่อปุ่ม
            Speed = 1.0, -- ความเร็วในการกดปุ่ม
            Text = "เพื่อเปิดเมนู" -- ข้อความ
        },
        Mark = { -- มาร์คเกอร์ในการมองเห้น
            Distance = 20.0, -- ระยะการมองเห็น
            PosZ = 1.0, -- แกน Z ของตำแหน่ง
            Marker = { -- มาร์คเกอร์
                Id = 2, -- ประเภท
                RotY = 180.0,
                Size = { x = 0.3, y = 0.3, z = 0.3 }, -- ขนาด
                Color = { r = 252, g = 62, b = 62, a = 100 }, -- สี
            },
            Object = { -- วัตถุ
                Type = "NPC", -- ประเภท NPC | OBJECT
                Model = "ig_claypain", -- ชื่อวัตถุ
                Heading = 160.0, -- ทิศทาง
            },
        },
    }
}