Config_Webhook = {}
Config_Webhook['Job'] = {
    Put = { 
		item 	= { 
			Title = 'เก็บของใส่ตู้',t1 = "\nได้เก็บ  :", t2 = '\nจำนวน  :', t3 = 'ชิ้น', t4 = '\nอาชีพ :', t5 = '\nเก็บของ ฝั่งหน่วยงาน', 
			webhook = '#' ,
		},

		Account = { 
			Title = 'เก็บของใส่ตู้', t1 = '\nได้เก็บ', t2 ='\nจำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nเก็บของ ฝั่งหน่วยงาน', 
			webhook = '#' ,
        },
		
		weapon 	= { 
			Title = 'เก็บของใส่ตู้',t1 = "\n ได้เก็บ  :", t2 = '\n จำนวน  :', t3 = 'นัด', t4 = '\nอาชีพ :', t5 = '\nเก็บของ ฝั่งหน่วยงาน', 
			webhook = '#' ,
		},
	},

	Take = {
		item 	= { 
			Title = 'นำของออกจากตู้', t1 = '\nได้นำ', t2 ='\nออกจากตู้จำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nนำออกของ ฝั่งหน่วยงาน', 
			webhook = '#' ,
		},

		Account = { 
			Title = 'นำของออกจากตู้', t1 = '\nได้นำ', t2 ='\nจำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nนำออกของ ฝั่งหน่วยงาน', 
			webhook = '#' ,
        },

		weapon 	= { 
			Title = 'นำของออกจากตู้', t1 = "\nได้นำ  :", t2 ='\nออกมาจำนวน  :', t3 = 'นัด', t4 = '\nอาชีพ :', t5 = '\nนำของออก ฝั่งหน่วยงาน', 
			webhook = '#' ,
		},
	},
}

Config_Webhook['Vault'] = {
    Put = { 
		item 	= { 
			Title = 'เก็บของใส่ตู้',t1 = "\nได้เก็บ  :", t2 = '\nจำนวน  :', t3 = 'ชิ้น', t4 = '\nอาชีพ :', t5 = '\nเก็บของ ฝั่งส่วนตัว', 
			webhook = '#' ,
		},
		Cash = { 
			Title = 'เก็บของใส่ตู้', t1 = '\nได้เก็บ', t2 ='\nจำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nเก็บของ ฝั่งส่วนตัว', 
			webhook = '#' ,
        },
        Account = { 
			Title = 'เก็บของใส่ตู้', t1 = '\nได้เก็บ', t2 ='\nจำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nเก็บของ ฝั่งส่วนตัว', 
			webhook = '#' ,
        },
		weapon 	= { 
			Title = 'เก็บของใส่ตู้',t1 = "\n ได้เก็บ  :", t2 = '\n จำนวน  :', t3 = 'นัด', t4 = '\nอาชีพ :', t5 = '\nเก็บของ ฝั่งส่วนตัว', 
			webhook = '#' ,
		},
	},

	Take = {
		item = { 
			Title = 'นำของออกจากตู้', t1 = '\nได้นำ', t2 ='\nออกจากตู้จำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nนำออกของ ฝั่งส่วนตัว', 
			webhook = '#' ,
        },
        Cash = { 
			Title = 'นำของออกจากตู้', t1 = '\nได้นำ', t2 ='\nออกจากตู้จำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nนำออกของ ฝั่งส่วนตัว', 
			webhook = '#' ,
        },
        Account = { 
			Title = 'นำของออกจากตู้', t1 = '\nได้นำ', t2 ='\nออกจากตู้จำนวน', t3 = 'ชิ้น' , t4 = '\nอาชีพ :', t5 = '\nนำออกของ ฝั่งส่วนตัว', 
			webhook = '#' ,
        },
		weapon 	= { 
			Title = 'นำของออกจากตู้', t1 = "\nได้นำ  :", t2 ='\nออกมาจำนวน  :', t3 = 'นัด', t4 = '\nอาชีพ :', t5 = '\nนำของออก ฝั่งส่วนตัว', 
			webhook = '#' ,
		},
	},
}