--===== FiveM Script =========================================
--= DB - Health and Armor
--===== Developed By: ========================================
--= Azael Dev
--===== Website: =============================================
--= https://www.azael.dev
--===== License: =============================================
--= Copyright (C) Azael Dev - All Rights Reserved
--= You are not allowed to sell this script or edit
--============================================================ 

Config = {}

Config['esx_routers'] = {									-- เส้นทางกิจกรรมของทรัพยากร ESX Framework
    ['client_shared_obj'] = 'esx:getSharedObject'			-- หาก es_extended เซิร์ฟเวอร์ของคุณ มีการแก้ไขชื่อกิจกรรมของทรัพยากร เพื่อป้องกันโปรแกรมโกงต่าง ๆ
}                                                           -- คุณสามารถแก้ไขการตั้งค่าในส่วนนี้ให้ตรงกับชื่อกิจกรรมของทรัพยากรนั้น ๆ ได้
                                                            -- หมายเหตุ: ห้ามแก้ไขการตั้งค่าในส่วนนี้โดยเด็ดขาด หากคุณไม่เข้าใจว่าสิ่งนี้คืออะไร เพราะอาจจะทำให้ทรัพยากรเกิดข้อผิดพลาดได้
                                                            
Config['ped_max_health'] = 200								-- พลังชีวิตของ Peds (ค่าปกติ เท่ากับ 200)
Config['ped_loaded_delay'] = 10								-- Delay ในการโหลด เลือด เเละ เกราะ ของ Peds ขณะเข้าสู่เซิร์ฟเวอร์ 1 เท่ากับ 1 วินาที
Config['enable_debug'] = false								-- เปิดใช้งานการเเสดงข้อความ Debug ไปยัง Server Console

Config['enable_health'] = true								-- เปิดใช้งาน บันทึก เลือด หรือไม่? (true เท่ากับ เปิดใช้งาน | false เท่ากับ เปิดใช้งาน)
Config['enable_armor'] = true								-- เปิดใช้งาน บันทึก เกราะ หรือไม่? (true เท่ากับ เปิดใช้งาน | false เท่ากับ เปิดใช้งาน)
