
--  สคริปสำหรับ ลูกค้าคนพิเศษนะครับ เก็บรักษาไว้ให้ด้วยน้า  ^^  

Config = {}
Config.Limit = true ----ถ้าเป้นน้ำหนัก ใส่ False 

---==================== UPDATE
Config.Key = 73             --------------สำหรับ เซฺฟที่กด X ไม่ยกเลิก ให้เปลี่ยนเป้น ปุ่มอื่นดู 

-- =======================================================================================
-- =======================================================================================
-- =======================================================================================
-- =======================================================================================
-- ================================== การตั้งค่า ตกปลา  AFK  ================================
-- =======================================================================================
-- =======================================================================================
-- =======================================================================================


-- ==========================================
-- ============  โซน  =======================
-- ==========================================

Config.ZoneAfk = {  -------------พิกัด ตกปลา 
    [1] = {
        coords = vector3(1926.5880, 403.7235, 161.4092), --พิกัด 
        dis = 100  --- ระยะ 
    }
    -- [2] = {
    --     coords = vector3(27.54811, 958.4902, 197.22),
    --     dis = 20
    -- }
}

Config.Itemuse = "fishingrod" -- เบ็ด   -------- ห้ามตั้งซ้ำกับ Zc_Oceanfish นะครับที่เหลือซ้ำได้
Config.Additem = "fish" -- ปลา
Config.Removeitem = "fishbait" -- เหยื่อ
Config.TimetoAdd = 30 -- เวลาที่ได้ของ
Config.Bonus = { --- โบนัส
    {
        ItemName = "crab_a", -- ปลาทู
        ItemCount = {1, 1}, -- COUNT
        Percent = 50 -- %
    },
    {
        ItemName = "shark", -- ปลาทู
        ItemCount = {1, 1}, -- COUNT
        Percent = 10 -- %
    },
    {
        ItemName = "exp", -- ปลาแซลมอน
        ItemCount = {1, 1}, -- COUNT
        Percent = 20 -- %
    }
}

-- ============ หลอดเลือด อาหาร ความเครียด   =====
-- ===========================================
Config.AFK = true ------------- เปิดปิดระบบ AFK
Config.HeadProps = 'text_afk' ---- ถ้าไม่เอาพร้อมใส่ false
-- ===========================================
Config.Food = true --- เพิ่มน้ำ + อาหารมั้ย 
Config.Stress = false -- เพิ่มหลอดความเครียดมั้ย
Config.DirtyandSleep = true ---- ถ้ามีอาบน้ำ นอน เปิด True
Config.Foodtime = 5 --- เวลาที่จะเพิ่มอาหารน้ำ / วินาที
Config.foodadd = 500 --- 1000 คือเต็ม
Config.stressremove = -100 --- ลยร้อยคือลบหมด ถ้าเพิ่ม ให้ใส่ลบแทนเช่น -100
Config.DirtyandSleepRemove = 0 --- ลยร้อยคือลบหมด ถ้าเพิ่ม ให้ใส่ลบแทนเช่น -200
Config.dirt = 'dirty' --- แก้ให้ตรงกับเซิฟตัวเองนะครับ บางเซิฟค่าเป็น 'dirt'
Config.sleep = 'sleep' --- แก้ให้ตรงกับเซิฟตัวเองนะครับ บางเซิฟค่าเป็น 'bed'
-- ====================================-
-- ============  BLIPS   =====
-- ===========================================
Config.OpenBlips = true
Config.Blips = 68
Config.BlipsSize = 1.0
Config.BlipsColor = 1
