Config = {}

Config.Locale = 'en'

Config.SpawnPlayer       = true    -- ต้องการเปิดให้มีการ Spawn จุดเกิดผู้เล่นใหม่หรือไม่
Config.TriggerSkin       = true    -- ต้องการเปิดให้มีการ Trigger Skin หรือไม่


 Config.Pos = {

 	{x = 212.20220947265626, y = 7416.7646484375, z = 18.73193359375 },
 	-- {x = -2848.0671, y = -775.0468, z = 6.6519 },
 	-- {x = -2833.7729, y = -785.6218, z = 6.6519 },
 	-- {x = -2816.3262, y = -776.4976, z = 6.6519 },
 	-- {x = -2814.5056, y = -768.5801, z = 6.6519 },
 	-- {x = -2818.2151, y = -759.4653, z = 6.6519 },
 	-- {x = -2826.6799, y = -754.5370, z = 6.6519 },
 	-- {x = -2852.9771, y = -764.9896, z = 6.6519 },
 	-- {x = -2857.5129, y = -774.1569, z = 6.6554 },
 	-- {x = -2855.9968, y = -781.2258, z = 6.6554 },
 	-- {x = -2851.7341, y = -789.7554, z = 6.6554 },
 }

 Config.Item = {
	{
		ItemName = "newplayer_box",  -- ชื่อไอเทม
		ItemCount = 1, -- จำนวน
		Percent = 100 -- เปอร์เซ็นที่จะได้รับของชิ้นนี้
	}
}